allure-results/18434598820a489986a2c63982f67c29-attachmentxml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><GetFeeFXDataWithPayer xmlns="http://tempuri.org/"><ParamFeeFxDataWithPayer><AgentID xmlns="http://schemas.datacontract.org/2004/07/WWC.DTC.Contracts">InvalidAgendId</AgentID><DeliveryMethod xmlns="http://schemas.datacontract.org/2004/07/WWC.DTC.Contracts">OFFICE PICKUP</DeliveryMethod><PayerId xmlns="http://schemas.datacontract.org/2004/07/WWC.DTC.Contracts">133</PayerId><PaymentMethod xmlns="http://schemas.datacontract.org/2004/07/WWC.DTC.Contracts">CASH</PaymentMethod><RecipientCountry xmlns="http://schemas.datacontract.org/2004/07/WWC.DTC.Contracts">BOL</RecipientCountry><RecipientCurrency xmlns="http://schemas.datacontract.org/2004/07/WWC.DTC.Contracts">USD</RecipientCurrency><SendAmount xmlns="http://schemas.datacontract.org/2004/07/WWC.DTC.Contracts">200</SendAmount><SendAmountCurrencyISOCode xmlns="http://schemas.datacontract.org/2004/07/WWC.DTC.Contracts">USD</SendAmountCurrencyISOCode><SubPayerId xmlns="http://schemas.datacontract.org/2004/07/WWC.DTC.Contracts">150</SubPayerId></ParamFeeFxDataWithPayer></GetFeeFXDataWithPayer></soap:Body></soap:Envelope>